In [1]:

people = {
    'First' : ['Jasim', 'Shanto', 'Abdur', 'Jewel'],
    'Last'  : ['Uddin', 'Rahman', 'Rahim', 'Mahmud'],
    'Email' : ['jasimcse@gmail.com', 'shantocse@gmail.com', 'rahimcse@gmail.com', 'jewelcse@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    First    Last                Email
0   Jasim   Uddin   jasimcse@gmail.com
1  Shanto  Rahman  shantocse@gmail.com
2   Abdur   Rahim   rahimcse@gmail.com
3   Jewel  Mahmud   jewelcse@gmail.com

In [5]:
df['First']+ ' ' + df['Last']

0      Jasim Uddin
1    Shanto Rahman
2      Abdur Rahim
3     Jewel Mahmud
dtype: object

In [6]:
df['fullname'] = df['First']+ ' ' + df['Last']

In [7]:
#df.columns = ['first','last', 'email', 'fullname']
df.rename(columns = {'First': 'first', 'Last': 'last'}, inplace=True)

In [8]:
df

    first    last                Email       fullname
0   Jasim   Uddin   jasimcse@gmail.com    Jasim Uddin
1  Shanto  Rahman  shantocse@gmail.com  Shanto Rahman
2   Abdur   Rahim   rahimcse@gmail.com    Abdur Rahim
3   Jewel  Mahmud   jewelcse@gmail.com   Jewel Mahmud

In [9]:
#df.drop(columns = 'last')

In [10]:
df.drop(columns = ['first', 'last'], inplace = True)

In [11]:
df['fullname'].str.split(' ', expand =True)

        0       1
0   Jasim   Uddin
1  Shanto  Rahman
2   Abdur   Rahim
3   Jewel  Mahmud

In [12]:
df[['first', 'last']] = df['fullname'].str.split(' ', expand =True)

In [13]:
df

                 Email       fullname   first    last
0   jasimcse@gmail.com    Jasim Uddin   Jasim   Uddin
1  shantocse@gmail.com  Shanto Rahman  Shanto  Rahman
2   rahimcse@gmail.com    Abdur Rahim   Abdur   Rahim
3   jewelcse@gmail.com   Jewel Mahmud   Jewel  Mahmud

In [14]:
df.append({'first': 'Tamim','last':'Dari', 'fullname': 'Tamim Dari', 'email': 'tamimcse@gmail.com'}, ignore_index = True)

                 Email       fullname   first    last               email
0   jasimcse@gmail.com    Jasim Uddin   Jasim   Uddin                 NaN
1  shantocse@gmail.com  Shanto Rahman  Shanto  Rahman                 NaN
2   rahimcse@gmail.com    Abdur Rahim   Abdur   Rahim                 NaN
3   jewelcse@gmail.com   Jewel Mahmud   Jewel  Mahmud                 NaN
4                  NaN     Tamim Dari   Tamim    Dari  tamimcse@gmail.com

In [15]:
people = {
    'first' : ['Jany', 'Shafiq'],
    'last'  : ['jay', 'Rahman'],
    'email' : ['janycse@gmail.com','shafiqcse@gmail.com']
}

In [16]:
df2 = pd.DataFrame(people)

In [17]:
df2

    first    last                email
0    Jany     jay    janycse@gmail.com
1  Shafiq  Rahman  shafiqcse@gmail.com

In [18]:
df.append(df2, ignore_index = True)

                 Email       fullname   first    last                email
0   jasimcse@gmail.com    Jasim Uddin   Jasim   Uddin                  NaN
1  shantocse@gmail.com  Shanto Rahman  Shanto  Rahman                  NaN
2   rahimcse@gmail.com    Abdur Rahim   Abdur   Rahim                  NaN
3   jewelcse@gmail.com   Jewel Mahmud   Jewel  Mahmud                  NaN
4                  NaN            NaN    Jany     jay    janycse@gmail.com
5                  NaN            NaN  Shafiq  Rahman  shafiqcse@gmail.com

In [19]:
df = df.append(df2, ignore_index = True)

In [20]:
df

                 Email       fullname   first    last                email
0   jasimcse@gmail.com    Jasim Uddin   Jasim   Uddin                  NaN
1  shantocse@gmail.com  Shanto Rahman  Shanto  Rahman                  NaN
2   rahimcse@gmail.com    Abdur Rahim   Abdur   Rahim                  NaN
3   jewelcse@gmail.com   Jewel Mahmud   Jewel  Mahmud                  NaN
4                  NaN            NaN    Jany     jay    janycse@gmail.com
5                  NaN            NaN  Shafiq  Rahman  shafiqcse@gmail.com

In [21]:
df.drop(index = 4)

                 Email       fullname   first    last                email
0   jasimcse@gmail.com    Jasim Uddin   Jasim   Uddin                  NaN
1  shantocse@gmail.com  Shanto Rahman  Shanto  Rahman                  NaN
2   rahimcse@gmail.com    Abdur Rahim   Abdur   Rahim                  NaN
3   jewelcse@gmail.com   Jewel Mahmud   Jewel  Mahmud                  NaN
5                  NaN            NaN  Shafiq  Rahman  shafiqcse@gmail.com

In [22]:

filt = df['last']=='Uddin'
df.drop(index = df[filt].index, inplace = True)

In [23]:
df

                 Email       fullname   first    last                email
1  shantocse@gmail.com  Shanto Rahman  Shanto  Rahman                  NaN
2   rahimcse@gmail.com    Abdur Rahim   Abdur   Rahim                  NaN
3   jewelcse@gmail.com   Jewel Mahmud   Jewel  Mahmud                  NaN
4                  NaN            NaN    Jany     jay    janycse@gmail.com
5                  NaN            NaN  Shafiq  Rahman  shafiqcse@gmail.com